foam/VisibleHuman_Head/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;
// kinematic viscosity of air ~ 1.5e-5 m^2/s
nu              [0 2 -1 0 0 0 0] 1.5e-05;
