foam/VisibleHuman_Head/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// Minimal snap: castellation + snap (no layers — add later for accuracy)
castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    solid_air_body.stl
    {
        type triSurfaceMesh;
        name solid_air_body;
    }
    left_nostril.stl
    {
        type triSurfaceMesh;
        name left_nostril;
    }
    right_nostril.stl
    {
        type triSurfaceMesh;
        name right_nostril;
    }
    trachea.stl
    {
        type triSurfaceMesh;
        name trachea;
    }
    wall.stl
    {
        type triSurfaceMesh;
        name wall;
    }
}

castellatedMeshControls
{
    maxLocalCells 2000000;
    maxGlobalCells 4000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
    );

    refinementSurfaces
    {
        solid_air_body
        {
            level (2 3);
            // Region-wise patch assignment after snap
            regions
            {
            }
        }
        left_nostril  { level (3 4); patchInfo { type patch; } }
        right_nostril { level (3 4); patchInfo { type patch; } }
        trachea       { level (3 4); patchInfo { type patch; } }
        wall          { level (2 3); patchInfo { type wall; } }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        solid_air_body
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    // Seed point MUST lie inside the air solid (metres)
    locationInMesh (0.251500 0.201000 1.580000);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 100;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
    }
    expansionRatio 1.2;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;
mergeTolerance 1e-6;
